Repository: 84000/data-translation-memory
Catalog: toh229-v4.tmx
Source language: bo
Languages: en

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་འདས་པའི་མཐའ་ཞེས་བགྱི་བའི་ཚིག་གི་དོན་གང་ལགས།
en: Blessed One, what is the meaning of the words the limit of the past?” “

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་ཆོས་ཐམས་ཅད་ནི་བསམ་གྱིས་མི་ཁྱབ་པའི་མཐའ་སྟེ།
en: Mañjuśrī, all phenomena are the inconceivable limit.

source: དེའི་ཕྱིར་འདས་པའི་མཐའ་ཞེས་བྱའོ།
en: That is the meaning of the limit of the past.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་མ་འོངས་པའི་མཐའ་ཞེས་བགྱི་བའི་ཚིག་གི་དོན་གང་ལགས།
en: Blessed One, what is the meaning of the words the limit of the future?” “

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་མ་འོངས་པའི་མཐའ་ནི་མ་སྐྱེས་པ་སྟེ། དེའི་ཕྱིར་མ་འོངས་པའི་མཐའ་ཞེས་བྱའོ།
en: Mañjuśrī, the extent of the future has not been born, that is the meaning of the limit of the future.”

source: །འཇམ་དཔལ་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཇི་ཙམ་དུ་དོན་ཤིན་ཏུ་རྣམ་པར་ངེས་པ་ངོ་མཚར་ལགས་སོ། །
en: Mañjuśrī said, “Blessed One, the extent to which the blessed buddhas ascertain the meaning is amazing!” “

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་དེ་བཞིན་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དོན་དང་ཚིག་ཤིན་ཏུ་རྣམ་པར་ངེས་པ་ཡིན་ནོ། །
en: Mañjuśrī, in the same way, the blessed buddhas ascertain the meaning and the words.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཚིག་རྣམ་པར་ངེས་པ་ཞེས་བགྱི་བའི་ཚིག་གི་དོན་གང་ལགས།
en: Blessed One, what is the meaning of ascertaining the words?” “

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་བྱས་པར་ངེས་པའོ།
en: Mañjuśrī, it refers to certainty that words are formed.

source: །ཅིའི་ཕྱིར་ངེས་ཞེ་ན།
en: Why certainty?

source: ཚིག་ལན་མེད་པར་ངེས་པའོ།
en: Because of certainty that words are beyond answer.

source: །ཅིའི་ཕྱིར་ཚིག་ལན་མེད་པར་ངེས་ཞེ་ན། ཅིར་ཡང་བརྗོད་པར་བྱ་བ་མ་ཡིན་པའི་ཕྱིར་རོ།
en: Why certainty that words are beyond answer? Because words are completely inexpressible.” “

source: །བཅོམ་ལྡན་འདས་བརྗོད་པར་བགྱི་བ་མ་ལགས་པའི་ཚིག་གི་དོན་གང་ལགས།
en: Blessed One, what is the meaning of inexpressible?” “

source: བཀའ་སྩལ་པ། སྨྲ་བ་ནི་བརྗོད་པར་བྱ་བ་སྟེ། སྨྲ་བ་ཐམས་ཅད་ནི་བརྗོད་པར་བྱ་བ་མ་ཡིན་པའོ།
en: Speech is expressible, but all speech is also inexpressible.

source: །སྨྲ་བ་གང་ཞེ་ན།
en: What is speech?

source: འཇམ་དཔལ་སྨྲ་བ་ནི་གནས་ཐ་དད་པ་ཞེས་བྱའོ།
en: Mañjuśrī, speech is ‘separate from the basis.’

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གནས་ཐ་དད་པ་ཞེས་བགྱི་བའི་ཚིག་གི་དོན་གང་ལགས།
en: ” “Blessed One, what is the meaning of the words separate from the basis?” “

source: བཀའ་སྩལ་པ། འཇམ་དཔལ་གནས་ཐ་དད་པ་ཞེས་བྱ་བ་ནི་སྨྲ་བ་འཛིན་པའི་འཛིན་པ་སྟེ།
en: Mañjuśrī, separate from the basis is the apprehension of speech.

source: མཚན་མར་འཛིན་པའོ།
en: It is apprehension of marks.

source: །སྲོག་ཏུ་འཛིན་པའོ།
en: It is apprehension of living.

source: །ཐམས་ཅད་འཛིན་པའོ།
en: It is apprehension of everything.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ཐམས་ཅད་འཛིན་པ་ལགས།
en: Blessed One, why does one apprehend everything?” “

source: བཀའ་སྩལ་པ། གཉི་ག་འཛིན་པ་ཡིན་པའི་ཕྱིར་རོ། །
en: Because one apprehends duality.” “

source: གསོལ་པ། ཅིའི་སླད་དུ་གཉི་ག་འཛིན་པ་ལགས།
en: Why does one apprehend duality?” “

source: བཀའ་སྩལ་པ། བདག་ཏུ་འཛིན་པ་དང་། གཞན་དུ་འཛིན་པ་སྟེ།
en: One apprehends self and other.

source: ཚིག་དེ་ནི་བདག་ཏུ་འཛིན་པ་དང་ལྡན་པ་ཡང་མ་ཡིན། གཞན་དུ་འཛིན་པ་དང་ལྡན་པ་ཡང་མ་ཡིན་ཏེ།
en: However, those words contain neither apprehension of self nor apprehension of other.

source: དེའི་ཕྱིར་ངེས་པ་ཞེས་བྱའོ།
en: That is why they are said to be ascertained.”

source: །དེ་ནས་བྱམས་མའི་བུ་གང་པོ་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ལེགས་པར་གསུངས་པའི་ཚིག་རབ་ཏུ་འབྱེད་པའོ།
en: At this point Pūrṇamaitrāyaṇīputra thought to himself, “The blessed buddhas fully determine the well-spoken words.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ངེས་པའི་དོན་གཅིག་ཏུ་སྒྲུབ་ཅིང་རྣམ་པར་དབྱེ་བ་ལ་མཁས་པའོ།
en: The blessed buddhas are skilled at clearly determining and classifying the definitive meaning.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཡེ་ཤེས་ཡོངས་སུ་གཏུགས་པ་མེད་པ་ཐུགས་སུ་ཆུད་པའོ།
en: The blessed buddhas have mastered inexhaustible wisdom.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཚིག་འབྲུ་གསལ་བའོ།
en: The blessed buddhas clarify words and sounds.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་ཀྱི་འཁོར་ལོ་ལ་ལྡེམ་པོར་དགོངས་པའི་བཀོད་པ་ལ་མངོན་པར་དགྱེས་པ་སྟེ།
en: The blessed buddhas delight in expressions with hidden intent in the wheel of the Dharma.

source: མ་ལ་བདག་གིས་བཅོམ་ལྡན་འདས་ལ་ཆོས་ཐམས་ཅད་ལ་ཡི་གེ་བསྒྲུབ་པའི་རྣམ་པར་དབྱེ་བ་ངེས་པར་རྣམ་པར་འབྱེད་པ་ཞུ་བར་བྱ་གོར་མ་ཆག་སྙམ་མོ།
en: Hence, I should make sure to request the Blessed One to give a presentation of the classifications created by words related to all phenomena.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱམས་མའི་བུ་གང་པོའི་སེམས་ཀྱི་རྣམ་པར་རྟོག་པ་ཐུགས་ཀྱིས་མཁྱེན་ནས། བྱམས་མའི་བུ་གང་པོ་ལ་བཀའ་སྩལ་པ། གང་པོ་ཡི་གེ་བསྒྲུབ་པའི་རྣམ་པར་དབྱེ་བ་ངེས་པར་རྣམ་པར་འབྱེད་པ་ལ་ངེས་པ་ཞེས་བྱ་བ་ལ་གཅིག་ནི་གང་ཡིན།
en: The Blessed One knew the thoughts of Pūrṇamaitrāyaṇīputra, so he said him, “Pūrṇa, as far as that ‘presentation of the classifications created by words,’ what is the primary ‘classification’?

source: བསྒྲུབ་པ་ནི་གང་ཡིན་ཞེ་ན།
en: What is meant by created by words?

source: གཅིག་ནི་མངོན་པར་ཤེས་པ་སྟེ། དེ་ནི་བསྒྲུབ་པའོ།
en: The primary classification is the superknowledges—that is what is created.

source: །སྒྲུབ་པ་སྒྲུབ་པ་ཞེས་བྱ་བ་ནི་གང་གི་ཡིན།
en: In whom is that created?

source: ཐོབ་པར་བྱེད་པ་ཐོབ་པར་བྱེད་པ་ནི་གང་གི་ཡིན་ཞེ་ན།
en: In whom is attainment gained?

source: ཐོབ་པར་བྱེད་པ་རྟོགས་པ་ནི་དེ་བཞིན་གཤེགས་པ་ཡིན་ཏེ། དེ་བཞིན་གཤེགས་པའི་འཇིག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་འབྱུང་བའོ།
en: The ones who understand attainment are the thus-gone ones—the disintegration of the thus-gone ones and the appearance of thus-gone ones.

source: །གང་པོ་དེ་བཞིན་གཤེགས་པ་དེ་བཞིན་གཤེགས་པ་ཞེས་ཅིའི་ཕྱིར་བརྗོད་པར་བྱ་ཞིང་སུས་བརྗོད་པར་བྱ་བ་ཡིན་ཞེ་ན།
en: Pūrṇa, why are thus-gone ones expressed as thus-gone ones, and who calls them that?

source: དངོས་པོས་ཀྱང་བརྗོད་པར་བྱ་བ་མ་ཡིན་ལ།
en: Entities are ineffable.

source: དངོས་པོ་མེད་པས་ཀྱང་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Because entities do not exist, they are ineffable.

source: །དངོས་པོ་ཡོད་པས་བརྗོད་པར་བྱ་བ་མ་ཡིན་ལ།
en: Because entities exist, they are ineffable.

source: དངོས་པོ་ཡོད་པ་མ་ཡིན་པས་བརྗོད་པར་བྱ་བ་ཡང་མ་ཡིན་ནོ།
en: Because entities are not existent, they are ineffable.

source: །དེ་བཞིན་གཤེགས་པ་ནི་ཚིག་ཐམས་ཅད་ལོག་པ་མ་ཡིན་ནོ།
en: Thus-gone ones are not contradictory with regard to any words.

source: །དེ་བཞིན་གཤེགས་པ་ནི་གནས་ལས་ལོག་པ་མ་ཡིན་ཏེ།
en: Thus-gone ones do not reverse from their basis.

source: ཚིག་ཐམས་ཅད་ཀྱིས་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ།
en: They cannot be expressed by any words.

source: །གང་པོ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་ནི་འདིའོ་ཞེས་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Pūrṇa, thus-gone ones cannot be described using specific statements.

source: །གང་པོ་དེ་བཞིན་གཤེགས་པ་ཞེས་བྱ་བ་ནི་བརྗོད་པར་བྱ་བ་མ་ཡིན་ཏེ།
en: Pūrṇa, ‘thus-gone ones’ are ineffable.

source: དཔེར་ན་ནམ་མཁའ་ནི་ལུས་སུ་གྱུར་པ་ཡང་མེད་དོ། །འགྱུར་བ་ཡང་མེད་དེ།
en: To give an analogy, space has no form, and it never will have form.

source: དེ་ནི་དངོས་པོ་དང་དངོས་པོ་མེད་པས་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Space is neither an existent thing nor a nonexistent thing, and thus it is ineffable.

source: །གང་པོ་དེ་བཞིན་གཤེགས་པ་མཐོང་ངོ་ཞེས་གང་གིས་བརྗོད་པ་དང་། གང་ལ་བརྗོད་པ་ཡང་བརྗོད་པར་བྱ་བ་མ་ཡིན་ནོ།
en: Pūrṇa, the one who says ‘meeting a thus-gone one’ and the one to whom it is said are also ineffable.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བྱམས་མའི་བུ་གང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཆོས་བསྟན་པ་འདིའི་མིང་ཅི་ལགས།
en: Then, Pūrṇamaitrāyaṇīputra asked the Blessed One, “Blessed One, what is the name of this Dharma teaching?”

source: བཀའ་སྩལ་པ། འདི་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བགྲོ་བའོ།
en: The Blessed One replied, “It is called Discussions of the Blessed Buddhas.

source: །གང་པོ་དེ་ནི་འདི་ཡིན་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་དེ་ནི་འདི་ཡིན་ཞེ་ན།
en: Pūrṇa, why is it identified as such?

source: གྲངས་མེད་པ་འདི་དག་གིས་བགྲོ་བར་བྱ་བ་དག་ནི་བགྲོ་བའོ།
en: Because these innumerable things are the objects of discussion.

source: །གང་པོ་ཅིའི་ཕྱིར་བགྲོ་བ་ཞེས་བྱ་ཞེ་ན།
en: Pūrṇa, why is it called discussion?

source: དེ་ནི་བགྲོ་བ་མེད་པ་དང་། རྣམ་པར་བགྲོ་བ་མེད་པ་འདི་ཡིན་ནོ།
en: Because there is neither discussion nor conversation.

source: །གང་པོ་ཆོས་ཀྱི་རྣམ་གྲངས་ཆོས་ཀྱི་རྣམ་གྲངས་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་ཞེས་བྱ་ཞེ་ན།
en: Pūrṇa, why is this Dharma teaching known as a Dharma teaching?

source: ཤེས་པར་བྱ་བ་མ་ཡིན་པའོ། །ཡོངས་སུ་ཤེས་པར་བྱ་བ་མ་ཡིན་པའོ།
en: It is not something that can be known or understood.

source: །མ་བརྗོད་པའོ། །མ་སྨྲས་པའོ། །སྒྲ་མེད་པའོ།
en: It is neither expressed, nor spoken, nor enunciated.

source: །བརྗོད་དུ་མེད་ཅིང་བརྗོད་པ་ལས་འདས་པའོ།
en: It is ineffable and beyond expression.

source: །རྣམ་པར་རིག་པ་མེད་པའོ།
en: It cannot be cognized.

source: །གདགས་པར་བྱ་བ་མ་ཡིན་པའོ།
en: It is not something that can be labeled.

source: །མི་གནས་པའོ།
en: It does not abide.

source: །བླང་དུ་མེད་ཅིང་དོར་དུ་མེད་པ་སྟེ།
en: It cannot be accepted or rejected.

source: ཆོས་དེ་དག་ནི་ཆོས་ཀྱི་རྣམ་གྲངས་སུ་བསྟན་ཏོ། །
en: Those qualities are taught to be the Dharma teaching. “

source: གང་པོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་གིས་ཚུལ་གྱི་གནས་འདི་ཁོང་དུ་ཆུད་པར་བྱེད་པ་དེ་དག་གི་ནི་དོན་དང་ཚིག་འབྲུས་ཡོངས་སུ་གཏུགས་པར་མི་འགྱུར་ཏེ།
en: Pūrṇa, for those noble sons or daughters who understand this natural way, their words and meanings will be inexhaustible.

source: གང་པོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་ལ་ངས་ཚུལ་གྱི་གནས་འདི་གཞག་པར་བྱའོ།
en: Pūrṇa, I shall present this natural way to those noble sons and daughters.

source: །གང་པོ་ཚུལ་གྱི་གནས་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་ཚུལ་གྱི་གནས་ཞེས་བྱ་ཞེ་ན།
en: Pūrṇa, what is meant by natural way?

source: གང་པོ་འདི་ནི་ཚུལ་གྱི་གནས་ཞེས་བྱ་བའམ།
en: Pūrṇa, this is neither a ‘natural way’ nor an ‘unnatural way.’

source: ཚུལ་མ་ཡིན་པའི་གནས་ཞེས་བྱ་བ་མེད་པ་དེའི་ཕྱིར་ཚུལ་གྱི་གནས་ཞེས་བརྗོད་དེ།
en: Therefore, it is called a natural way.

source: གང་པོ་ཚིག་གཙོ་བོ་དེ་ནི་འདི་ཡིན་ནོ།
en: Pūrṇa, these are the essential words.

source: །གང་པོ་ཚིག་གཙོ་བོ་ཚིག་གཙོ་བོ་ཞེས་བྱ་བ་ཅིའི་ཕྱིར་ཚིག་གཙོ་བོ་ཞེས་བྱ། དེ་དག་ཅིའི་ཕྱིར་ཚིག་གཙོ་བོ་ཞེས་བྱ་ཞེ་ན།
en: Pūrṇa, why are the essential words called the essential words?

source: གང་པོ་དཔེར་ན་རྣམ་པར་ཐར་པ་རྣམས་ཀྱི་ཚིག་གི་དོན་བཞིན་ནོ།
en: Pūrṇa, it is because, for example, they are like the literal meaning of the liberations. “

source: །གང་པོ་གཞན་ཡང་ཚིག་རབ་ཏུ་དབྱེ་བ་ཞེས་བྱ་བ་གང་གི་ཚིག་རབ་ཏུ་དབྱེ་བའི་རང་བཞིན་སྣང་བ་ཡིན་ཞེ་ན།
en: Furthermore, Pūrṇa, when one says ‘classification of words,’ what is the nature of the classification of words that will manifest?

source: རང་བཞིན་གྱིས་དངོས་པོ་མེད་པ་དེ་ལྟར་སྣང་ངོ་།
en: They manifest while being insubstantial by nature.

source: །སྣང་བ་དེ་ནི་འདི་ལྟར་སྣང་སྟེ།
en: That is how that manifestation manifests.

source: ཆོས་ཐམས་ཅད་སྣོད་མ་ཡིན་པ་དེ་ལྟར་སྣང་ངོ་།
en: All phenomena, which are not vessels, manifest in that way.

source: །གང་པོ་སྣང་བ་དང་བྲལ་བ་དེ་ལྟར་སྣང་ངོ་།
en: Pūrṇa, they manifest without being manifested.

source: །གང་པོ་ལས་དང་རྣམ་པར་སྨིན་པ་སྣང་བ་ལ། ལས་ནི་གང་།
en: Pūrṇa, as far as manifesting action and ripening, what is action?

source: རྣམ་པར་སྨིན་པ་ནི་གང་ཞེ་ན།
en: What is ripening?

source: གང་པོ་ལས་ནི་གང་དཀར་པོ་དང་ནག་པོ་དང་། དཀར་པོ་ཡང་མ་ཡིན་ནག་པོ་ཡང་མ་ཡིན་པའོ།
en: Pūrṇa, actions may be white, black, and those that are neither white nor black.

source: །རྣམ་པར་སྨིན་པ་ནི་ངེས་པར་སྤངས་པ་སྟེ།
en: Ripening is abandonment.

source: དེ་ལྟར་སྣང་བ་ཡིན་ནོ།
en: That is how it manifests.

source: །ཆོས་ཐམས་ཅད་དབྱེར་མེད་པ་དེའི་ཕྱིར་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: All phenomena are indivisible, and that is why it is known as correct knowledge.

source: །ཅིའི་ཕྱིར་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱ་ཞེ་ན།
en: Why is it called correct knowledge?

source: དོན་ས་སོ་ཡང་དག་པར་རིག་པའོ།
en: Because it is correct knowledge of meaning.

source: །དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་གང་ཞེ་ན།
en: What is correct knowledge of meaning?

source: དོན་ཅེས་བྱ་བ་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ། གང་རང་བཞིན་གྱིས་དབྱེར་མེད་པའོ།
en: The ‘meaning’ is empty by nature; it is indivisible by nature.

source: །རྣམ་པ་ཐམས་ཅད་དུ་རང་བཞིན་གྱིས་སྟོང་ཞིང་དབྱེར་མེད་དེ།
en: It is naturally empty and indivisible in all regards.

source: དེའི་ཕྱིར་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: Therefore, it is known as correct knowledge of meaning. “

source: །ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། ཆོས་སོ་སོ་ཡང་དག་པར་རིག་པ་ཅིའི་ཕྱིར་ཆོས་ས་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱ་ཞེ་ན།
en: As for the correct knowledge of language, correct knowledge of eloquence, and correct knowledge of phenomena, what is meant by correct knowledge of phenomena?

source: ཆོས་རྣམས་ཀྱི་རང་བཞིན་ནི་ཆོས་ཉིད་དེ་དེ་ནི་མ་བྱས་པའོ།
en: The nature of phenomena is the uncreated reality.

source: །གང་མ་བྱས་པ་དེ་ནི་རང་བཞིན་ཏེ།
en: That which is uncreated is their nature.

source: དེ་ནི་དབྱེར་མེད་པས་ཆོས་རྣམས་ཀྱི་དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ཞེས་བྱའོ།
en: Since it is indivisible, it is known as correct knowledge of the meaning of phenomena.

source: །སྤོབས་པའི་རང་བཞིན་ཅིའི་ཕྱིར་རང་བཞིན་ཞེས་བྱ་ཞེ་ན།
en: Why is the nature of eloquence called nature?

source: ཆོས་ཐམས་ཅད་དབྱེར་མེད་པ་དེ་ལྟར་སྣང་བའོ།
en: It is the way that all indivisible phenomena manifest.

source: །ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་དངོས་པོ་མེད་པ་དེ་ལྟར་སྣང་བའོ།
en: It is the way that all naturally insubstantial phenomena manifest.

source: །ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་འགགས་པ་དེ་ལྟར་སྣང་བའོ།
en: It is the way that all naturally ceasing phenomena manifest.

source: །ཆོས་ཐམས་ཅད་མིག་ཡོར་དང་མཚུངས་པ་དེ་ལྟར་སྣང་བའོ།
en: It is the way that all phenomena, which are like hallucinations, manifest. “

source: །གང་པོ་གཞན་ཡང་ལས་ནི་སྣ་ཚོགས་སུ་སྣང་སྟེ། ལས་དེ་ཡང་རྣམ་པར་སྨིན་པས་སྣ་ཚོགས་པ་ཉིད་དོ།
en: Moreover, Pūrṇa, actions manifest in various ways, and there are various ways of ripening due to those actions.

source: །གང་པོ་རྣམ་པར་སྨིན་པ་དེ་ཡང་དབང་པོས་སམ། དབང་པོ་བྱེ་བ་ཕྲག་དགུ་བཅུའམ། བྱེ་བ་ཕྲག་བརྒྱའི་སྒ་ནས་ལས་ཀྱི་རྣམ་པར་ཕྱེ་བས་ཐ་དད་པ་སྟེ།
en: Pūrṇa, those forms of ripening are determined on the basis of the differentiation of actions from the perspective of the individual faculties, or the nine hundred million faculties, or the one billion faculties.

source: དེ་ལྟར་སྣང་ངོ་།
en: That is how they manifest.

source: །རྣམ་པར་སྨིན་པའི་ཆེད་དུ་ལས་སྐྱེད་པར་སྣང་སྟེ། འདིར་སྐྱེད་པ་ནི་སྐྲུན་པ་སྟེ། ཀུན་ཏུ་སྐྱེད་པའོ།
en: In order for ripening to occur, actions appear to be generated. That generation is manufactured and produced.

source: །ཅིའི་ཕྱིར་ཀུན་ཏུ་སྐྱེད་པ་ཞེས་བྱ་ཞེ་ན།
en: Why is it said to be ‘produced’?

source: སྡུག་བསྔལ་ཀུན་ཏུ་སྐྱེད་པའི་ཕྱིར་རོ།
en: Because suffering is produced.

source: །སྡུག་བསྔལ་གང་ཞེ་ན་སྲེད་པ་དང་ལྟ་བའོ།
en: What is suffering? It is craving and views.

source: །དེ་ལ་ལྟ་བ་ལ་ཆགས་པ་གང་ཞེ་ན།
en: What is attachment to views?

source: གང་དུ་འགྲོ་བ་ཡང་མེད་ཅིང་གནས་པ་ཡང་མེད་པ་ཡིན་ན་བྱིས་པ་རྣམས་ནི་ལྟ་བ་མེད་བཞིན་དུ་ལྟ་བ་ལ་ཆགས་ནས་ཀུན་ཏུ་རྒྱུག་གོ།
en: Even though there is no going and no abiding, childish, ordinary beings become attached to views—even though there are no views—and so they rush forth.

source: །གང་དག་ཀུན་ཏུ་རྒྱུག་པ་དེ་དག་ནི་རྣམ་པར་རྒྱུག་གོ།
en: Those beings who rush forth become immersed.

source: །གང་དག་རྣམ་པར་རྒྱུག་པ་དེ་དག་ནི་རྣམ་པར་ཉམས་སོ།
en: Those who become immersed deteriorate.

source: །གང་དག་རྣམ་པར་ཉམས་པ་དེ་དག་ནི་རྣམ་པར་རྒྱུག་གོ།
en: Those who deteriorate become immersed.

source: །གང་དག་རྣམ་པར་རྒྱུག་པ་དེ་དག་ནི་རྩོད་པར་བྱེད་དོ།
en: Those who become immersed cause arguments.

source: །ཅིའི་ཕྱིར་རྩོད་པར་བྱེད་ཅེ་ན།
en: Why do they cause arguments?

source: ཡོད་པ་མ་ཡིན་པ་དང་། གསོག་དང་། བལྟར་མེད་པ་ལ་རྩོད་པར་བྱེད་དོ།
en: Because they argue about nonexistent, hollow, and imperceptible things.

source: །གཞན་ཡང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཡང་དག་པར་སྡོམ་པ་མ་ཡིན་པ་རྣམས་ནི་གང་སྐྱེད་ཅེས་བྱ་བ་དེ་ལྟར་སྣང་སྟེ།
en: Moreover, for childish, ordinary beings who are not restrained, that which is ‘generated’ is what manifests.

source: སྣང་བ་ནི་དེའི་ངེས་པའི་ཚིག་ཏུ་སྣང་བ་ཞེས་བྱའོ།
en: Such manifestations are then referred to as linguistic manifestations. “

source: །གང་པོ་བསྒྲུབ་པ་ཞེས་བྱ་བ་གང་གི་བསྒྲུབ་པ་ཞེ་ན།
en: Pūrṇa, as for ‘accomplishment,’ what is accomplished?

source: ཡི་གེའི་བསྒྲུབ་པའོ།
en: It is the accomplishment of syllables.

source: །གང་པོ་ཅིའི་ཕྱིར་ཡི་གེ་ཞེས་བྱ་ཞེ་ན།
en: Pūrṇa, why are they called syllables?

source: གང་ཟག་པ་མེད་པའི་ཕྱིར་རོ།
en: Because they are inexhaustible.

source: །གང་པོ་ཡི་གེ་ཞེས་བྱ་བ་ནི་གཟོད་མ་ནས་ཟད་པའོ།
en: Pūrṇa, ‘syllables’ are primordially exhausted.

source: །གང་པོ་གཟོད་མ་ནས་ཟད་ཅེས་བྱ་བ་ནི་ཟད་པ་མེད་པའོ།
en: Pūrṇa, that which is ‘primordially exhausted’ is inexhaustible.

source: །གང་པོ་གཞན་ཡང་ཟད་པ་མེད་པ་དང་། ཟད་པ་མེད་པའི་སྒོ་ཞེས་བྱ་བ་ནི་ཆོས་ཐམས་ཅད་དོ།
en: Moreover, Pūrṇa, that which is inexhaustible and the inexhaustible gateway refer to all phenomena.

source: །ཟད་པ་མེད་པ་དང་། ཟད་པ་མེད་པའི་སྒོ་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་སྒོ་སྟེ།
en: The inexhaustible and the inexhaustible gateway, which refer to all phenomena, are the gateway of phenomena.

source: གང་པོ་ཆོས་ཀྱི་སྒོ་འདི་ནི་ནམ་མཁའི་སྒོ་ཡིན་ཏེ།
en: Pūrṇa, this gateway of phenomena is the gateway of space.

source: རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཞུགས་པ་དེ་ནི་ངེས་པའི་ཚིག་བསྟན་པ་ལ་ཟད་པ་མེད་པར་འགྱུར་རོ།
en: Those noble sons or daughters who enter that gateway will gain an inexhaustible ability to teach language.

source: །གང་པོ་ངས་ཆོས་ཀྱི་སྒོ་ཟད་པ་མེད་པ་འདི་ཀུན་དགའ་བོ་ལ་གཏད་པར་བྱའོ།
en: Pūrṇa, I will entrust this inexhaustible gateway of phenomena to Ānanda.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །
en: The Blessed One then said to venerable Ānanda, “Ānanda, you must remember this Dharma teaching.

source: ཆོངས་ཤིག །ལྷོགས་ཤིག །ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: You must preserve it, recite it, and understand it.

source: ཀུན་དགའ་བོ་གང་ལ་ལ་ཞིག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་ཏམ། འཆང་ངམ། ཀློག་གམ། ཀུན་ཆུབ་པར་བྱེད་དམ། ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་ཙམ་བཟུང་ནས་གཞན་དག་ལ་སྟོན་པར་བྱེད་པ་དེ་ནི་ཀུན་དགའ་བོ་སངས་རྒྱས་ཀྱི་མཛད་པ་བྱེད་པ་ཡིན་ཏེ།
en: Ānanda, those who remember this Dharma teaching, preserve it, recite it, and understand it—and even those who merely remember a four-line verse and teach it to others—will, Ānanda, be engaged in the deeds of a buddha.

source: འདི་གཞན་ལ་སྟོན་པར་བྱེད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ཡིན་པ་དེའི་དགེ་བའི་རྩ་བ་མང་དུ་སྐྱེད་པར་འགྱུར་རོ།
en: Those noble sons or daughters who teach this to others will increase their roots of virtue.

source: །ཀུན་དགའ་བོ་དེའི་ཕྱིར་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཁྱོད་ལ་ལན་གཉིས་སུ་ཡོངས་སུ་གཏད་པས་ཡོངས་སུ་གཏད་དོ།
en: Therefore, Ānanda, I will entrust this Dharma teaching to you by conferring it upon you twice.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཕྱག་གཡས་པས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་བཟུང་ནས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ངའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བ་ཕྲག་འབུམ་དུ་ཡང་དག་པར་བསྒྲུབས་པ་འདི་ཁྱོད་ཀྱི་ལག་ཏུ་ཡོངས་སུ་གཏད་ཀྱིས།
en: The Blessed One touched venerable Ānanda with his right hand and said, “Ānanda, I place my unexcelled and perfect awakening, accomplished over many billions of incalculable eons, in your hands.

source: ཅི་ནས་ཀྱང་ཟུང་ལ་གཞན་དག་ལ་ཡང་ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: By all means, you must remember it and help others understand it.

source: ཞུགས་ནས་ཀྱང་གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་སྒྲོགས་ཤིག །
en: Later on, you must also promulgate it widely.

source: ཀུན་དགའ་བོ་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་དེ་བཞིན་གཤེགས་པ་བགྲོ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་ཏམ། ཀུན་ཆུབ་པར་བྱེད་དམ། འཇུག་པར་བྱེད་པ་དེ་ལ་ནི་ཚེ་འདི་ལ་ཡོན་ཏན་ལྔ་བརྒྱ་འབྱུང་བར་འགྱུར་རོ།
en: Ānanda, those noble sons or daughters who remember, understand, and engage in this Dharma teaching on the discussions about thus-gone ones will have five hundred qualities arise in them during this life.

source: །ལྔ་བརྒྱ་གང་ཞེ་ན།
en: What are those five hundred?

source: ལུས་ལ་ཡོན་ཏན་བརྒྱ་དང་། ངག་གི་ལས་ཀྱི་ཡོན་ཏན་བརྒྱ་དང་། ཡིད་ཀྱི་ལས་ཀྱི་ཡོན་ཏན་བརྒྱ་དང་། ཀུན་ཏུ་བསྲུངས་པའི་ཡོན་ཏན་བརྒྱ་དང་། ཆོས་ཀྱི་ཡོན་ཏན་བརྒྱ་པོ་དག་གོ།
en: There are one hundred qualities of the body, one hundred qualities of verbal action, one hundred qualities of mental action, one hundred qualities of protection, and one hundred qualities of Dharma. “

source: །ཀུན་དགའ་བོ་དེ་ལ་ལུས་ལ་གནས་པའི་སྲིན་བུའི་རིགས་གང་དག་ཡིན་པ་དེ་དག་དེའི་ལུས་ལ་འབྱུང་བར་མི་འགྱུར་རོ།
en: Ānanda, the classes of worms that inhabit the body will not infect that person’s body.

source: །ཀུན་དགའ་བོ་དེ་ལྟར་ན་དེ་དག་ལ་མིག་ནད་མི་འབྱུང་ཞིང་རྣ་བའི་ནད་མེད། སྣའི་ནད་མེད། ལྕེའི་ནད་མེད་ཅིང་ལུས་ཀྱི་ནད་ཀྱང་མི་འབྱུང་ངོ་། །
en: Nor will they be afflicted by diseases of the eye, ear, nose, tongue, or body.

source: མིག་ལ་སྡུག་བསྔལ་མི་འབྱུང་ཞིང་རྣ་བ་དང་། སྣ་དང་། ལྕེ་དང་། ལུས་དང་། ཡིད་ལ་སྡུག་བསྔལ་མི་འབྱུང་ངོ་། །
en: They will likewise not experience pain in their eyes, ears, nose, tongue, or body.

source: མིག་ལ་ཀུན་ནས་གནོད་པ་མི་འབྱུང་ངོ་། །མིག་མི་གསལ་བར་མི་འགྱུར་རོ། །མིག་ཟུམས་པར་མི་འགྱུར་རོ། །མིག་འཁྲུལ་པར་མི་འགྱུར་རོ། །མིག་འཇིགས་འཇིགས་ལྟ་བུར་མི་འགྱུར་རོ། །མིག་ལོང་བར་མི་འགྱུར་རོ། །མིག་ཡོན་པོར་མི་འགྱུར་རོ། །མིག་ཡ་གཅིག་པར་མི་འགྱུར་རོ། །མིག་ཟུར་གྱིས་ལྟ་བར་མི་འགྱུར་རོ། །
en: They will also not have injuries to their eyes, their eyes will not become unclear, their eyes will not be closed, their eyes will not be distorted, their eyes will not appear to be fearful, they will not go blind, their eyes will not become crooked, their eyes will not lose their symmetry, and their eyes will not become crossed.

source: མིག་གསལ་བར་འགྱུར་རོ། །མིག་ཀུན་ཏུ་བལྟ་བར་འགྱུར་རོ། །མིག་མ་ཉམས་ཤིང་གཞོན་བག་ཅན་དུ་འགྱུར་རོ།
en: Rather, their eyes will be clear, their eyes will be sharp, and their eyes will be unimpaired and youthful.

source: །མིག་རྨ་བྱའི་མགྲིན་པ་ལྟ་བུ་དང་།
en: Their eyes will be like the throat of a peacock.

source: མིག་གླང་པོའི་རྒྱལ་པོ་འགྱིང་ཞིང་འགྲོ་བ་ལྟ་བུར་འགྱུར་རོ།
en: Their eyes will have the dignity and movement of the king of elephants.

source: །གསང་བ་སྦ་བར་འགྱུར་རོ།
en: Their private parts will be concealed.

source: །ཡན་ལག་བཅུ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Their ten limbs will be pure.

source: །ཉིང་ལག་བཅུ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Their ten minor body parts will be pure.

source: །ཉིང་ལག་མེད་པ་བཅུ་རྣམ་པར་དག་པར་འགྱུར་རོ།
en: Their ten body parts without division will be pure.

source: །རྣ་བ་བཅུ་རྣམ་པར་དག་པར་འགྱུར་རོ། །སྣ་བཅུ་རྣམ་པར་དག་པར་འགྱུར་རོ། །ལྕེ་བཅུ་རྣམ་པར་དག་པར་འགྱུར་རོ། །བ་སྤུའི་ཁུང་བུ་འཁོར་ལྔ་པ་རྣམ་པར་དག་པར་འགྱུར་རོ། །འབྲས་ཆན་ལ་ཡོད་པའི་རོ་བྲོ་བ་ཉི་ཤུ་རྩ་གཅིག་མྱང་བ་རྣམ་པར་དག་པར་འགྱུར་ཏེ།
en: The ten aspects of their ears, the ten aspects of their nose, the ten aspects of their tongue, the five areas of their pores, and their experience of the twenty-one flavors present in food will all be purified.

source: ལུས་ཀྱི་ཡོན་ཏན་འདི་དག་ཐོབ་པར་འགྱུར་རོ།
en: These are the qualities of the body that they will obtain. “

source: །དེ་ལ་ངག་གི་ལས་ཀྱི་ཡོན་ཏན་བརྒྱ་ཐོབ་པར་འགྱུར་བ་གང་ཞེ་ན།
en: What are the one hundred qualities of verbal action that they will obtain?

source: དབྱངས་ཀྱིས་བསྒྱུར་བའི་ངག་གི་ལས་ཀྱི་ཡོན་ཏན་བཅུ་དང་། གཞན་བསྲུངས་པའི་ངག་གི་ལས་ཀྱི་ཡོན་ཏན་བཅུ་དང་། མ་འོངས་པའི་སྐྱོན་བསྲུངས་པའི་ངག་གི་ལས་ཀྱི་ཡོན་ཏན་བཅུ་དང་། ད་ལྟར་བྱུང་བའི་སྐྱོན་བསྲུངས་པའི་ངག་གི་ལས་ཀྱི་ཡོན་ཏན་བཅུ་དང་། སངས་རྒྱས་ཀྱིས་གནང་བའི་ངག་གི་ལས་བཀྲ་ཤིས་པ་བཅུ་དང་། ལས་ཀྱི་རྗེས་སུ་འབྲེལ་བའི་ངག་གི་ལས་བཅུ་དང་། ལྷས་གནང་བའི་ངག་གི་ལས་དང་ཞིང་ཕན་པ་བཅུ་དང་། བསླབ་པ་ཡོངས་སུ་བཟུང་བའི་ངག་གི་ལས་བཅུ་དང་། ངོ་བོ་ཉིད་ཀྱིས་ཡོན་ཏན་དང་ལྡན་པའི་ངག་གི་ལས་བཅུ་སྟེ།
en: They are the ten qualities of verbal action that transform through the voice, the ten qualities of verbal action that protect others, the ten qualities of verbal action that protect against future mistakes, the ten qualities of verbal action that protect against mistakes in the present, the ten auspicious verbal actions of the buddhas, the ten verbal actions that are connected with actions, the ten verbal actions performed by the gods and the ten beneficial actions, the ten verbal actions of adhering to the training, and the ten verbal actions endowed with inherent qualities.

source: ངག་གི་ལས་ཀྱི་ཡོན་ཏན་བརྒྱ་པོ་འདི་དག་ཐོབ་པར་འགྱུར་རོ།
en: They will obtain these one hundred qualities of verbal action. “

source: །དེ་ལ་ཡིད་ཀྱི་ལས་ཀྱི་ཡོན་ཏན་བརྒྱ་ཐོབ་པར་འགྱུར་བ་གང་ཞེ་ན།
en: What are the one hundred qualities of mental action that they will obtain?
